app/Views/templates/sidebar.php

SELECT DISTINCT `kelas`
FROM `matakuliah`
WHERE `nip` = '123'
---
    <li class="nav-item">
        <?php
            $db = \Config\Database::connect();
            $matkul = $db->table('matakuliah')->select('kelas')->distinct()->getWhere(['nip' => session('username')])->getResultArray();

SELECT *
FROM `matakuliah`
WHERE `kelas` = '15.5B.01'
---
            <div class="bg-gray-800 py-2 collapse-inner rounded">
                <h6 class="collapse-header text-light">Pilih:</h6>
                <?php
                $getmatkul = $db->table('matakuliah')->getWhere(['kelas' => $mtk['kelas']])->getResultArray();