app/Views/templates/sidebar.php

    <li class="nav-item">
        <?php
            $db = \Config\Database::connect();
            $matkul = $db->table('matakuliah')->select('matakuliah')->distinct()->getWhere(['nip' => session('username')])->getResultArray();
---
SELECT DISTINCT `matakuliah`
FROM `matakuliah`
WHERE `nip` = '122'

        </a>
        <div id="data<?= $i; $i++;?>" class="collapse" aria-labelledby="headingUtilities"data-parent="#accordionSidebar">
            <?php
                $getkls = $db->table('matakuliah')->getWhere(['matakuliah' => $mtk['matakuliah']])->getResultArray();
---
SELECT *
FROM `matakuliah`
WHERE `matakuliah` = 'Komunikasi Tradisional'

    <li class="nav-item">
        <?php
            $db = \Config\Database::connect();
            $get = $db->table('mahasiswa')->getWhere(['nim' => session('username')])->getRowArray();
            $matkul = $db->table('matakuliah')->select('*')->distinct()->getWhere(['kelas' => $get['kelas']])->getResultArray();
---
SELECT *
FROM `mahasiswa`
WHERE `nim` = '15200318'
SELECT DISTINCT *
FROM `matakuliah`
WHERE `kelas` = '15.5B.01'