app/Views/kuliah/tugas.php

                        <td><?= date('d-m-Y H:i:s', $m['tanggal']);?></td>
                        <td>
                            <?php
                            $cek = $db->table('nilai')->where(['id_tugas' => $m['id']])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `nilai`
WHERE `id_tugas` = '11'