app/Controllers/Dosen.php

SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `matkul` = '1'
---
    public function absensi()
    {
        $modeluser = new ModelUser();
        $modelkuliah = new ModelKuliah();
        $db = \Config\Database::connect();
        $uri = service('uri');
        $idmatkul = base64_decode($uri->getSegment(3));
        $kelas = base64_decode($uri->getSegment(4));

        $data['judul'] = 'Absensi Mahasiswa';
        $data['user'] = $modeluser->cekData(['username' => session('username')])->getRowArray();
        $data['absensi'] = $modelkuliah->getAbsensi(['matkul' => $idmatkul], ['kelas' => $kelas])->getResultArray();
        $data['pertemuan'] = $db->table('absen')->where(['matkul' => $idmatkul], ['kelas' => $kelas])->countAllResults();