app/Controllers/Dosen.php

    public function materi()
    {
        $modeluser = new ModelUser();
        $modelkuliah = new ModelKuliah();
        $data['judul'] = 'Upload Materi';
        $uri = service('uri');
        $db = \Config\Database::connect();
        $idmtk = base64_decode($uri->getSegment(3));
        $kelas = base64_decode($uri->getSegment(4));
        $matkul = $db->table('matakuliah')->getWhere(['id' => $idmtk])->getRowArray();
        // $dosen = $modeluser->getDosen(['nip']);
        $data['klas'] = $kelas ." || ". $matkul['matakuliah'];
        $data['user'] = $modeluser->cekData(['username' => session('username')])->getRowArray();
        $data['kelas'] = $modelkuliah->getKelasDistinct(['nip' => session('username')])->getResultArray();
        $data['matkul'] = $modelkuliah->getMatkulDistinct(['nip' => session('username')])->getResultArray();
        $data['materi'] = $modelkuliah->getMateri(['nip' => session('username'), 'matakuliah' => $matkul['matakuliah'], 'kelas' => $kelas])->getResultArray();
        $data['pertemuan'] = $db->table('materi')->where(['matakuliah' => $matkul['matakuliah'], 'kelas' => $kelas])->orderBy('pertemuan','desc')->get()->getRowArray();
---
SELECT *
FROM `matakuliah`
WHERE `id` = '1'
SELECT *
FROM `materi`
WHERE `matakuliah` = 'Web Programming'
AND `kelas` = '15.5B.01'
ORDER BY `pertemuan` DESC

                'pertemuan' => $_POST['pertemuan'],
                'link' => $_POST['link']
            ];
            $db->table('materi')->set($data)->where('id', base64_decode($uri->getSegment(5)))->update();
---
UPDATE `materi` SET `prodi` = 'Ilmu Ekonomi', `matakuliah` = 'Komunikasi Tradisional', `kelas` = '14.5B.01', `judul` = 'pt 1', `deskripsi` = 'tes', `pertemuan` = '1', `link` = 'asdsad'
WHERE `id` = '11'

    public function semua()
    {
        $modeluser = new ModelUser();
        $modelkuliah = new ModelKuliah();
        $db = \Config\Database::connect();
        $uri = service('uri');
        $idmtk = base64_decode($uri->getSegment(3));
        $mtk = $db->table('matakuliah')->getWhere(['id' => $idmtk])->getRowArray();
---
SELECT *
FROM `matakuliah`
WHERE `id` = '1'

    public function absensi()
    {
        $modeluser = new ModelUser();
        $modelkuliah = new ModelKuliah();
        $db = \Config\Database::connect();
        $uri = service('uri');
        $idmatkul = base64_decode($uri->getSegment(3));
        $kelas = base64_decode($uri->getSegment(4));
        $status = "Belum Selesai";
        $mtk = $db->table('matakuliah')->getWhere(['id' => $idmatkul])->getRowArray();

        $data['kelas'] = $kelas ." || ". $mtk['matakuliah'];
        $data['jadwal2'] = $db->table('matakuliah')->getWhere(['id' => $idmatkul])->getRowArray();
        $data['jadwal'] = $db->table('absen')->join('matakuliah', 'absen.matkul = matakuliah.id')->getWhere(['absen.matkul' => $idmatkul, 'absen.kelas' => $kelas])->getRowArray();
        $data['judul'] = 'Absensi Mahasiswa';
        $data['user'] = $modeluser->cekData(['username' => session('username')])->getRowArray();
        $data['absensi'] = $modelkuliah->getAbsensi(['matkul' => $idmatkul, 'absen.kelas' => $kelas])->getResultArray();
        $data['pertemuan'] = $db->table('absen')->where(['matkul' => $idmatkul, 'kelas' => $kelas])->orderBy('absen.pertemuan','desc')->get()->getRowArray();
        $data['cek'] = $db->table('absen')->where(['matkul' => $idmatkul, 'kelas' => $kelas, 'status' => $status])->get()->getResultArray();
---
SELECT *
FROM `matakuliah`
WHERE `id` = '9'
SELECT *
FROM `absen`
JOIN `matakuliah` ON `absen`.`matkul` = `matakuliah`.`id`
WHERE `absen`.`matkul` = '9'
AND `absen`.`kelas` = '15.1B.01'
SELECT *
FROM `matakuliah`
WHERE `id` = '1'
SELECT *
FROM `absen`
WHERE `matkul` = '9'
AND `kelas` = '15.1B.01'
ORDER BY `absen`.`pertemuan` DESC
SELECT *
FROM `absen`
WHERE `matkul` = '9'
AND `kelas` = '15.1B.01'
AND `status` = 'Belum Selesai'

    private function _absensi()
    {
        $uri = service('uri');
        $idmtk = base64_decode($uri->getSegment('3'));
        $db = \Config\Database::connect();
        $rules = [
            'pertemuan' => 'required',
        ];

        $messages = [
            'pertemuan' => [
                'required' => 'Pertemuan Harus Dipilih'
            ]
        ];

        if(!$this->validate($rules, $messages)){
            session()->setFlashdata('pesan', '<div class="alert alert-danger alert-message" role="alert">Open Absensi Gagal, Silahkan dicek kembali!</div>');
            return redirect()->back()->withInput();
        } else {
            $kls = base64_decode($uri->getSegment('4'));
            $get = $db->table('mahasiswa')->getWhere(['kelas' => $kls])->getResultArray();
---
SELECT *
FROM `mahasiswa`
WHERE `kelas` = '15.5B.01'

                    'tanggal' => time(),
                    'status' => 'Belum Selesai'
                ];
                $db->table('absen')->set($data)->insert();
---
INSERT INTO `absen` (`nim`, `kelas`, `matkul`, `pertemuan`, `tanggal`, `status`) VALUES ('15200318', '15.5B.01', '1', '1', 1669434323, 'Belum Selesai')

    public function ubahmtk()
    {
        $modeluser = new ModelUser();
        $db = \Config\Database::connect();
        $uri = service('uri');
        $data['validation'] = \Config\Services::validation();
        $data['judul'] = 'Ubah Matakuliah';
        $data['dosen'] = $db->table('dosen')->get()->getResultArray();
        $data['user'] = $modeluser->cekData(['username' => session('username')])->getRowArray();
        $data['matkul'] = $db->table('matakuliah')->join('dosen', 'matakuliah.nip = dosen.nip')->getWhere(['id' => base64_decode($uri->getSegment(3))])->getRowArray();
---
SELECT *
FROM `dosen`
SELECT *
FROM `matakuliah`
JOIN `dosen` ON `matakuliah`.`nip` = `dosen`.`nip`
WHERE `id` = '9'

    private function _ubahmtk()
    {
        $db = \Config\Database::connect();
        $uri = service('uri');
        $data = [
            'prodi' => $_POST['prodi'],
            'matakuliah' => $_POST['matakuliah'],
            'semester' => $_POST['semester'],
            'kelas' => $_POST['kelas'],
            'jadwal' => $_POST['jadwal'],
            'nip' => $_POST['nip'],
        ];

        $db->table('matakuliah')->set($data)->where(['id' => base64_decode($uri->getSegment(3))])->update();
---
UPDATE `matakuliah` SET `prodi` = 'Ilmu Komputer5', `matakuliah` = 'wp 15', `semester` = '2', `kelas` = '15.1B.015', `jadwal` = 'Selasa, 12:00 - 14:35', `nip` = '123'
WHERE `id` = '9'