app/Controllers/Kuliah.php

    public function materi()
    {
        $modeluser = new ModelUser();
        $modelkuliah = new ModelKuliah();
        $db = \Config\Database::connect();
        $mhs = $modeluser->getMahasiswa(['nim' => session('username')])->getRowArray();
        $uri = service('uri');
        $idmtk = base64_decode($uri->getSegment(3));
        // var_dump($idmtk);
        $mtk = $db->table('matakuliah')->getWhere(['id' => $idmtk])->getRowArray();
---
SELECT *
FROM `matakuliah`
WHERE `id` = '11'

    public function tugas()
    {
        $modeluser = new ModelUser();
        $modelkuliah = new ModelKuliah();
        $db = \Config\Database::connect();
        $data['db'] = \Config\Database::connect();
        $mhs = $modeluser->getMahasiswa(['nim' => session('username')])->getRowArray();
        $uri = service('uri');
        $idmtk = base64_decode($uri->getSegment(3));
        $mtk = $db->table('matakuliah')->getWhere(['id' => $idmtk])->getRowArray();
---
SELECT *
FROM `matakuliah`
WHERE `id` = '1'

    public function nilai()
    {
        $modeluser = new ModelUser();
        $modelkuliah = new ModelKuliah();
        $db = \Config\Database::connect();
        $uri = service('uri');
        $idmtk = base64_decode($uri->getSegment(3));
        $mtk = $db->table('matakuliah')->getWhere(['id' => $idmtk])->getRowArray();
---
SELECT *
FROM `matakuliah`
WHERE `id` = '5'