app/Models/ModelKuliah.php

SELECT *
FROM `absen`
JOIN `mahasiswa` ON `absen`.`nim` = `mahasiswa`.`nim`
JOIN `matakuliah` ON `absen`.`matkul` = `matakuliah`.`id`
WHERE `matkul` = '1'
---
    public function getAbsensi($where = null)
    {
        return $this->db->table('absen')->select('*')->join('mahasiswa', 'absen.nim = mahasiswa.nim')->join('matakuliah', 'absen.matkul = matakuliah.id')->getWhere($where);