app/Models/ModelKuliah.php

SELECT *
FROM `materi`
WHERE `id` = '16'
---
    public function getMateri($where = null)
    {
        return $this->db->table('materi')->getWhere($where);

SELECT `absen`.`id`, `mahasiswa`.`nim`, `mahasiswa`.`nama`, `mahasiswa`.`kelas`, `matakuliah`.`matakuliah`, `absen`.`pertemuan`, `absen`.`tanggal`, `absen`.`status_absen`, `absen`.`status`
FROM `absen`
JOIN `mahasiswa` ON `absen`.`nim` = `mahasiswa`.`nim`
JOIN `matakuliah` ON `absen`.`matkul` = `matakuliah`.`id`
WHERE `matkul` = '1'
AND `absen`.`kelas` = '15.5B.01'
---
    public function getAbsensi($where = null)
    {
        return $this->db->table('absen')->select('absen.id, mahasiswa.nim, mahasiswa.nama, mahasiswa.kelas, matakuliah.matakuliah, absen.pertemuan, absen.tanggal, absen.status_absen, absen.status')->join('mahasiswa', 'absen.nim = mahasiswa.nim')->join('matakuliah', 'absen.matkul = matakuliah.id')->getWhere($where);

SELECT *
FROM `nilai`
JOIN `mahasiswa` ON `nilai`.`nim` = `mahasiswa`.`nim`
WHERE `mahasiswa`.`nim` = '15200318'
---
    public function joinNilai($where)
    {
        return $this->db->table('nilai')->select('*')->join('mahasiswa', 'nilai.nim = mahasiswa.nim')->where($where)->get();